{"id":12608,"date":"2023-05-02T06:21:13","date_gmt":"2023-05-02T06:21:13","guid":{"rendered":"https:\/\/okstartups.com\/?page_id=12608"},"modified":"2023-09-09T21:25:41","modified_gmt":"2023-09-09T21:25:41","slug":"refund-policy","status":"publish","type":"page","link":"https:\/\/okstartups.com\/refund-policy\/","title":{"rendered":"Refund Policy"},"content":{"rendered":"\n<h1 class=\"wp-block-heading\">Return and Refund Policy<\/h1>\n\n\n\n<p>Last updated: April 25, 2023<\/p>\n\n\n\n<p>Thank you for shopping at Okstartups.<\/p>\n\n\n\n<p>If, for any reason, You are not completely satisfied with a purchase We invite You to review our policy on refunds and returns. <\/p>\n\n\n\n<p>The following terms are applicable for any products that You purchased with Us.<\/p>\n\n\n\n<p>Interpretation and Definitions<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Interpretation<\/h2>\n\n\n\n<p>The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Definitions<\/h2>\n\n\n\n<p>For the purposes of this Return and Refund Policy:<\/p>\n\n\n\n<p><strong>Company<\/strong> (referred to as either &#8220;the Company&#8221;, &#8220;We&#8221;, &#8220;Us&#8221; or &#8220;Our&#8221; in this Agreement) refers to Okstartups.<\/p>\n\n\n\n<p><strong>Goods<\/strong> refer to the items offered for sale on the Service.<\/p>\n\n\n\n<p><strong>Orders<\/strong> mean a request by You to purchase Goods from Us.<\/p>\n\n\n\n<p><strong>Service<\/strong> refers to the Website.<\/p>\n\n\n\n<p><strong>Website<\/strong> refers to Okstartups, accessible from <a href=\"okstartups.com\">www.okstartups.com<\/a><\/p>\n\n\n\n<p><strong>You<\/strong> means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.<\/p>\n\n\n\n<p>Your Order Cancellation Rights<\/p>\n\n\n\n<p>You are entitled to cancel Your Order within 30 days without giving any reason for doing so.<\/p>\n\n\n\n<p>The deadline for cancelling an Order is 30 days from the date on which You received the Goods or on which a third party you have appointed, who is not the carrier, takes possession of the product delivered.<\/p>\n\n\n\n<p>In order to exercise Your right of cancellation, You must inform Us of your decision by means of a clear statement. You can inform us of your decision by:<\/p>\n\n\n\n<ul>\n<li>By email: connect@okstartups.com<\/li>\n<\/ul>\n\n\n\n<p>We will reimburse You no later than 14 days from the day on which We receive the returned Goods. We will use the same means of payment as You used for the Order, and You will not incur any fees for such reimbursement.<\/p>\n\n\n\n<p>Conditions for Returns<\/p>\n\n\n\n<p>In order for the Goods to be eligible for a return, please make sure that:<\/p>\n\n\n\n<ul>\n<li>The Goods were purchased in the last 30 days<\/li>\n\n\n\n<li>The Goods are in the original packaging<\/li>\n<\/ul>\n\n\n\n<p>The following Goods cannot be returned:<\/p>\n\n\n\n<ul>\n<li>The supply of Goods made to Your specifications or clearly personalized.<\/li>\n\n\n\n<li>The supply of Goods which according to their nature are not suitable to be returned, deteriorate rapidly or where the date of expiry is over.<\/li>\n\n\n\n<li>The supply of Goods which are not suitable for return due to health protection or hygiene reasons and were unsealed after delivery.<\/li>\n\n\n\n<li>The supply of Goods which are, after delivery, according to their nature, inseparably mixed with other items.<\/li>\n<\/ul>\n\n\n\n<p>We reserve the right to refuse returns of any merchandise that does not meet the above return conditions in our sole discretion.<\/p>\n\n\n\n<p>Only regular priced Goods may be refunded. Unfortunately, Goods on sale cannot be refunded. This exclusion may not apply to You if it is not permitted by applicable law.<\/p>\n\n\n\n<p>Returning Goods<\/p>\n\n\n\n<p>You are responsible for the cost and risk of returning the Goods to Us. You should send the Goods at the following address:<\/p>\n\n\n\n<p>to the registred office mentioned on the website<\/p>\n\n\n\n<p>We cannot be held responsible for Goods damaged or lost in return shipment. Therefore, We recommend an insured and trackable mail service. We are unable to issue a refund without actual receipt of the Goods or proof of received return delivery.<\/p>\n\n\n\n<p>Gifts<\/p>\n\n\n\n<p>If the Goods were marked as a gift when purchased and then shipped directly to you, You&#8217;ll receive a gift credit for the value of your return. Once the returned product is received, a gift certificate will be mailed to You.<\/p>\n\n\n\n<p>If the Goods weren&#8217;t marked as a gift when purchased, or the gift giver had the Order shipped to themselves to give it to You later, We will send the refund to the gift giver.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Contact Us<\/h2>\n\n\n\n<p>If you have any questions about our Returns and Refunds Policy, please contact us:<\/p>\n\n\n\n<ul>\n<li>By email: connect@okstartups.com<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Return and Refund Policy Last updated: April 25, 2023 Thank you for shopping at Okstartups. If, for any reason, You are not completely satisfied with a purchase We invite You to review our policy on refunds and returns. The following terms are applicable for any products that You purchased with Us. Interpretation and Definitions Interpretation [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"blocksy_meta":[],"_links":{"self":[{"href":"https:\/\/okstartups.com\/wp-json\/wp\/v2\/pages\/12608"}],"collection":[{"href":"https:\/\/okstartups.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/okstartups.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/okstartups.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/okstartups.com\/wp-json\/wp\/v2\/comments?post=12608"}],"version-history":[{"count":0,"href":"https:\/\/okstartups.com\/wp-json\/wp\/v2\/pages\/12608\/revisions"}],"wp:attachment":[{"href":"https:\/\/okstartups.com\/wp-json\/wp\/v2\/media?parent=12608"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}